Repository: sushain97/apertium-monorepo-svn-82937
Catalog: incubator/en-ga-corpus/tmx/1922-1.tmx
Source language: en
Languages: ga

source: Dáil Eireann shall be composed of members who represent constituencies determined by law
ga: Beidh i nDáil Éireann teachtaí agus iad ag ionadú dáilcheantar a socrófar le dlí

source: The number of members shall be fixed from time to time by the Oireachtas, but the total number of members of Dáil Eireann (exclusive of members for the Universities) shall not be fixed at less than one member for each thirty thousand of the population, or at more than one member for each twenty thousand of the population: Provided that the proportion between the number of members to be elected at any time for each constituency and the population of each constituency, as ascertained at the last preceding census, shall, so far as possible, be identical throughout the country
ga: Socróidh an t-Oireachtas uimhir na dteachtaí ó am go ham, ach ní socrófar lán-uimhir theachtaí Dháil Éireann (lasmuich de theachtaí na bPríomh-sgoileanna) fé bhun teachta in agha gach deich míle fichead den líon tíre, ná os cionn teachta in agha gach fiche míle den líon tíre: Ar choiníoll, gurb é an cothrom céanna chó fada agus is féidir, a bheidh ar fuaid na tíre idir uimhir na dteachtaí a bheidh le togha aon uair do gach dáilcheantar agus líon tíre gach dáilcheantair, ar n-a fháil sin amach sa chomhaireamh deireanach roimhe sin

source: The members shall be elected upon principles of Proportional Representation
ga: Is do réir Ionaduíochta Cothromúla a toghfar na teachtaí

source: The Oireachtas shall revise the constituencies at least once in every ten years, with due regard to changes in distribution of the population, but any alterations in the constituencies shall not take effect during the life of Dáil Eireann sitting when such revision is made
ga: Déanfaidh an t-Oireachtas ath-chóiriú ar na dáilcheantair uair amháin gach deich mbliana ar a luighead, gan sóinseáil in áireamh áitiúil an lín tíre do dhearmhad, ach ní thiocfaidh aon atharú sna dáilcheantair i bhfeidhm i rith téarma na Dála a bheidh ann le linn a leithéid d'ath-chóiriú do dhéanamh

source: Each University in the Irish Free State (Saorstát Eireann), which was in existence at the date of the coming into operation of this Constitution, shall be entitled to elect three representatives to Dáil Eireann upon a franchise and in a manner to be prescribed by law
ga: Beidh de cheart ag gach Príomh-sgoil i Saorstát Éireann, do bhí ann ar dháta an Bhun-reachta so do theacht i bhfeidhm, trí teachtaí do thogha do Dháil Éireann ar reacht-shaoirse agus ar nós a socrófar le dlí

source: At a General Election for Dáil Eireann the polls (exclusive of those for members for the Universities) shall be held on the same day throughout the country, and that day shall be a day not later than thirty days after the date of the dissolution, and shall be proclaimed a public holiday
ga: Le linn Toghacháin Ghenearálta do Dháil Éireann déanfar an vótáil (lasmuich den vótáil do theachtaí do sna Príomh-sgoileanna) ar an lá céanna ar fuaid na tíre, agus ní bheidh an lá san thar deich lá fichead tar eis dáta an sgurtha agus fógrófar 'na lá saoire puiblí é

source: Dáil Eireann shall meet within one month of such day, and shall, unless earlier dissolved, continue for four years from the date of its first meeting, and not longer
ga: Tiocfaidh Dáil Éireann le chéile fé cheann mí ón lá san, agus mara sguirfear níos túisce í, leanfa sí ar feadh cheithre mblian ó dháta a céad chruinnithe, agus ní leanfa sí níos sia ná san

source: Dáil Eireann may not at any time be dissolved except on the advice of the Executive Council
ga: Ní féadfar Dáil Éireann do sgur aon uair ach ar chomhairle na hArd-Chomhairle

source: In case of death, resignation or disqualification of a member of Dáil Eireann, the vacancy shall be filled by election in manner to be determined by law
ga: I gcás teachta de Dháil Éireann d'fháil bháis, do thabhairt suas no do theacht fé mhí-cháilíocht, líonfar an follamhantas le togha ar chuma a socrófar le dlí

source: Seanad Eireann shall be composed of citizens who shall be proposed on the grounds that they have done honour to the Nation by reason of useful public service or that, because of special qualifications or attainments, they represent important aspects of the Nation's life
ga: Beidh i Seanad Éireann saoránaigh a ainmneofar as ucht onóir do bheith déanta acu don Náisiún le seirbhís phuiblí úsáideach, no, de bhrí cháilíocht no bhua speisialta do bheith acu, go n-ionaduighid tréithe táchtacha de shaol an Náisiúin

source: The number of members of Seanad Eireann shall be sixty
ga: Sé uimhir bhall Sheanaid Éireann trí fichid

source: A citizen to be eligible for membership of Seanad Eireann must be a person eligible to become a member of Dáil Eireann, and must have reached the age of thirty-five years
ga: Chun go mbeidh saoránach iontoghtha chun bheith 'na bhall de Sheanad Éireann caithfe sé bheith 'na dhuine iontoghtha chun bheith 'na theachta de Dháil Éireann, agus caithfidh aois a chúig bliana déag ar fhichid bheith slán aige

source: Subject to any provision for the constitution of the first Seanad Eireann the term of office of a member of Seanad Eireann shall be twelve years
ga: Gan dochar d'aon fhoráil a ceapfar chun bunuithe an chéad Sheanaid is é téarma oifige gach baill den tSeanad dhá bhliain déag

source: One-fourth of the members of Seanad Eireann shall be elected every three years from a panel constituted as hereinafter mentioned at an election at which the area of the jurisdiction of the Irish Free State (Saorstát Eireann) shall form one electoral area, and the elections shall be held on principles of Proportional Representation
ga: Toghfar an ceathrú cuid de bhaill Sheanaid Éireann gach trí bliana ó ainm-liost a déanfar ar chuma a luaidhtear 'na dhiaidh seo agus déanfar san ag toghachán 'na mbeidh líomatáiste údaráis Shaorstáit Éireann mar aon líomatáiste toghacháin amháin, agus is do réir Ionaduíochta Cothromúla a déanfar an toghachán

source: Before each election of members of Seanad Eireann a panel shall be formed consisting of:—
ga: Roimh gach toghachán do bhaill Sheanaid Éireann déanfar ainm-liost do chur le chéile 'na mbeidh:—

source: (a) Three times as many qualified persons as there are members to be elected, of whom two thirds shall be nominated by Dáil Eireann voting according to principles of Proportional Representation and one-third shall be nominated by Seanad Eireann voting according to principles of Proportional Representation; and
ga: (a) A thrí oirid de dhaoine oiriúnacha agus atá de bhaill le togha; agus díobh san ainmneoidh Dáil Éireann dhá dtrian ag vótáil do réir Ionaduíochta Cothromúla agus Seanad Éireann trian amháin ag vótáil do réir Ionaduíochta Cothromúla; agus

source: (b) Such persons who have at any time been members of Seanad Eireann (including members about to retire) as signify by notice in writing addressed to the President of the Executive Council their desire to be included in the panel
ga: (b) Pé daoine do bhí aon uair 'na mbaill de Sheanad Éireann (mar aon le baill atá i ndeire a dtéarma) a chuirfidh in úil d'Uachtarán na hArd-Chomhairle le fógra i scríbhinn gur mian leo a gcur ar an ainm-liost

source: The method of proposal and selection for nomination shall be decided by Dáil Eireann and Seanad Eireann respectively, with special reference to the necessity for arranging for the representation of important interests and institutions in the country: Provided that each proposal shall be in writing and shall state the qualifications of the person proposed and that no person shall be proposed without his own consent
ga: Socróidh Dáil Éireann agus Seanad Éireann fé seach an tslí déanfar tairisgint agus togha chun ainmniúcháin, maille le aireachas speisialta do thabhairt don riachtanas atá le ionaduíocht do sholáthar do leasanna agus d'fhundúireachtaí táchtacha sa dúthaigh: Ar choiníoll go mbeidh gach tairisgint i scríbhinn agus go luaidhfear inte cáilíocht an té a tairgeofar, agus ná tairgeofar aon duine gan a chead féin

source: As soon as the panel has been formed a list of the names of the members of the panel arranged in alphabetical order with their qualifications shall be published
ga: Chó luath is cuirfear an t-ainm-liost le chéile foillseofar liost ar órdú aibítre d'ainmneacha lucht an ainm-liosta mar aon le n-a gcáilíocht

source: In case of the death, resignation or disqualification of a member of Seanad Eireann his place shall be filled by a vote of Seanad Eireann
ga: I gcás ball de Sheanad Éireann d'fháil bháis, do thabhairt suas, no do theacht fé mhí-cháilíocht, líonfar a ionad le vóta de Sheanad Éireann

source: Any member of Seanad Eireann so chosen shall retire from office at the conclusion of the three years period then running and the vacancy thus created shall be additional to the places to be filled under Article 32 of this Constitution
ga: Imeoidh aon bhall de Sheanad Éireann a toghfar mar sin as oifig ar chríochnú na tréimhse trí mblian a bheidh an uair sin ag rith agus cuirfear an follamhntas a thárlóidh mar sin i dteanta na n-ionad a bheidh le líona fé Airtiogal 32 den Bhun-reacht so

source: The term of office of the members chosen at the election after the first fifteen elected shall conclude at the end of the period or periods at which the member or members of Seanad Eireann, by whose death or withdrawal the vacancy or vacancies was or were originally created, would be due to retire: Provided that the sixteenth member shall be deemed to have filled the vacancy first created in order of time and so on
ga: Críochnóidh téarma oifige na mball a toghfar tar éis an chéad chúig dhuine dhéag do thogha, ar chríochnú na tréimhse no na dtréimhsí go mbeadh imeacht as oifig i ndán don bhall no do sna baill de Sheanad Éireann gurb é a mbás no a dtabhairt suas fé ndear ar dtúis an follamhntas no na follmhntaisí do dhéanamh: Ar choiníoll go dtuigfear an follamhntas is túisce do thárla in órdú aimsire do bheith líonta ag an séú ball déag agus mar sin de

source: Dáil Eireann shall in relation to the subject matter of Money Bills as hereinafter defined have legislative authority exclusive of Seanad Eireann
ga: Is ag Dáil Éireann amháin lasmuich de Sheanad Éireann a bheidh údarás reachtúcháin maidir le abhar Billí Airgid mar a mínítear 'na dhiaidh seo

source: A Money Bill means a Bill which contains only provisions dealing with all or any of the following subjects, namely, the imposition, repeal, remission, alteration or regulation of taxation; the imposition for the payment of debt or other financial purposes of charges on public moneys or the variation or repeal of any such charges; supply; the appropriation, receipt, custody, issue or audit of accounts of public money; the raising or guarantee of any loan or the repayment thereof; subordinate matters incidental to those subjects or any of them
ga: Cialluíon Bille Airgid Bille ná fuil ann ach forálacha i dtaobh gach abhair no aon abhair díobh so leanas, eadhon, leaga, ath-ghairm, maitheamh, atharú no rialú cánach; muirir do leaga ar airgead phuiblí chun fiacha do dhíol no chun cúrsaí eile airgid, no a leithéidí sin de mhuirir d'atharú no d'athghairm; soláthar; airgead puiblí do chur i leithreas, d'fháil, do chimeád, do thabhairt amach no a chuntaisí do scrúdú; tógaint no urús aon iasachta no a aisioc; mion-chúrsaí ag baint leis na habhair seo no le haon cheann aca

source: In this definition the expressions "taxation," "public money" and "loan" respectively do not include any taxation, money or loan raised by local authorities or bodies for local purposes
ga: Sa mhíniú so ní fholuíonn na focail “cáin” “airgead puiblí” agus “iasacht” fé seach aon cháin, airgead ná iasacht a thógfaidh lucht údaráis áitiúla chun úsáide áitiúla

source: The Chairman of Dáil Eireann shall certify any Bill which in his opinion is a Money Bill to be a Money Bill, but, if within three days after a Bill has been passed by Dáil Eireann two-fifths of the members of either House by notice in writing addressed to the Chairman of the House of which they are members so require, the question whether the Bill is or is not a Money Bill shall be referred to a Committee of Privileges consisting of three members elected by each House with a Chairman who shall be the senior judge of the Supreme Court able and willing to act, and who, in the case of an equality of votes, but not otherwise, shall be entitled to vote
ga: Deimhneoidh Ceann Comhairle Dháil Éireann gur Bille Airgid aon Bhille atá 'na Bhille Airgid dar leis, ach, fé cheann trí lá tar eis Bille do bheith rithte ag Dáil Éireann, má éilíonn dhá chúigiú de bhaill aon Tighe é, le fógra i scríbhinn do Cheann Comhairle an Tighe dár baill iad, déanfar an cheíst i dtaobh ce'ca Bille Airgid no nách eadh an Bille d'fhágaint fé Choiste ar Phríbhléidí ar a mbeidh trí baill a thoghfaidh gach Tigh agus mar Cheann Comhairle ortha an breitheamh is aoirde céim den Chúirt Uachtarach a bheidh ábalta agus toilteannach ar fheidhmiú, agus a bheidh, i gcás có-ionannas vótanna, agus sa chás san amháin, i dteideal vótála

source: The decision of the Committee on the question shall be final and conclusive
ga: Ní bheidh aon dul thar breith an Choiste ar an gceist

source: Dáil Eireann shall as soon as possible after the commencement of each financial year consider the Estimates of receipts and expenditure of the Irish Free State (Saorstát Eireann) for that year, and, save in so far as may be provided by specific enactment in each case, the legislation required to give effect to the Financial Resolutions of each year shall be enacted within that year
ga: Breithneoidh Dáil Éireann, chó luath agus is féidir tar éis tosnuithe gach bliana airgid, meastacháin fháltais agus chaiteachais Shaorstáit Éireann i gcóir na bliana san, agus, ach sa méid go ndéanfaí achtú sonrách 'na thaobh i ngach cás, achtófar fé cheann na bliana an reachtúchán is gá chun Rúin Airgid gach bliana d'fheidhmiú

source: Money shall not be appropriated by vote, resolution or law, unless the purpose of the appropriation has in the same session been recommended by a message from the Representative of the Crown acting on the advice of the Executive Council
ga: Ní cuirfear airgead i leithreas le vóta, le rún ná le dlí, mara ndéanfar sa tsiosón céanna intinn a churtha i leithreas do mhola trí theachtaireacht ó Ionadaí na Coróinneach ar chomhairle na hArd-Chomhairle

source: Every Bill initiated in and passed by Dáil Eireann shall be sent to Seanad Eireann and may, unless it be a Money Bill, be amended in Seanad Eireann and Dáil Eireann shall consider any such amendment; but a Bill passed by Dáil Eireann and considered by Seanad Eireann shall, not later than two hundred and seventy days after it shall have been first sent to Seanad Eireann, or such longer period as may be agreed upon by the two Houses, be deemed to be passed by both Houses in the form in which it was last passed by Dáil Eireann: Provided that every Money Bill shall be sent to Seanad Eireann for its recommendations and at a period not longer than twenty-one days after it shall have been sent to Seanad Eireann, it shall be returned to Dáil Eireann which may pass it, accepting or rejecting all or any of the recommendations of Seanad Eireann, and as so passed or if not returned within such period of twenty-one days shall be deemed to have been passed by both Houses
ga: Cuirfear chun Seanaid Éireann gach Bille do tionnscnuíodh i nDáil Éireann agus do ritheadh ag Dáil Éireann agus maran Bille Airgid é, féadfaidh Seanad Éireann é do leasú agus breithneoidh Dáil Éireann aon leasú dá shórt; ach Bille a rithfidh Dáil Éireann agus a bhreithneoidh Seanad Éireann, tuigfear i gcionn dhá ohéad agus deich lá is trí fichid ar a dhéanaí tar éis é do chur chun an tSeanaid den chéad uair, no i gcionn pé tréimhse níos sia ná san le n-a dtoileoidh an dá Thigh, gur rith an dá Thigh é sa bhfuirm is déanaí 'nar rith Dáil Éireann é: Ar choiníoll go gcuirfear gach Bille Airgid chun an tSeanaid chun a mholta san d'fháil air agus i gcionn tréimhse nách sia ná lá is fiche tar éis é do chur chun an tSeanaid, go gcuirfear thar n-ais é go dtí Dáil Éireann a fhéadfaidh é rith, agus molta uile Sheanaid Éireann no aon mhola aca do ghlaca no do dhiúlta, agus, mar a bheidh rithte mar sin, no mara gcuirfear thar n-ais fé cheann an lae is fiche sin é tuigfear é bheith rithte ag an dá Thigh

source: When a Bill other than a Money Bill has been sent to Seanad Eireann a Joint Sitting of the Members of both Houses may on a resolution passed by Seanad Eireann be convened for the purpose of debating, but not of voting upon, the proposals of the Bill or any amendment of the same
ga: Tar éis Bille nách Bille Airgid do chur go dtí Seanad Éireann féadfar Co-shuidhe de Bhaill an dá Thighe do thabhairt le chéile ar rún a rithfidh Seanad Éireann, chun díospóireacht, ach gan vótáil, do dhéanamh ar intinn an Bhille no ar aon leasú air

source: A Bill may be initiated in Seanad Eireann and if passed by Seanad Eireann shall be introduced into Dáil Eireann
ga: Féadfar Bille do thionnscnamh i Seanad Éireann agus má ritheann Seanad Éireann é tabharfar isteach i nDáil Éireann é

source: If amended by Dáil Eireann the Bill shall be considered as a Bill initiated in Dáil Eireann
ga: Má leasuítear i nDáil Éireann é breithneofar ar nós Bille do tionnscnuíodh i nDáil Éireann é

source: If rejected by Dáil Eireann it shall not be introduced again in the same session, but Dáil Eireann may reconsider it on its own motion
ga: Má diúltuítear i nDáil Éireann é ní tabharfar isteach arís é sa tsiosón chéanna, ach féadfaidh Dáil Éireann é d'aith-bhreithniú ar a tairisgint féin

source: A Bill passed by either House and accepted by the other House shall be deemed to be passed by both Houses
ga: Bille a rithfear ag Tigh agus a glacfar ag an dTigh eile tuigfear é bheith rithte ag an dá Thigh

source: So soon as any Bill shall have been passed or deemed to have been passed by both Houses, the Executive Council shall present the same to the Representative of the Crown for the signification by him, in the King's name, of the King's assent, and such Representative may withhold the King's assent or reserve the Bill for the signification of the King's pleasure: Provided that the Representative of the Crown shall in the withholding of such assent to or the reservation of any Bill, act in accordance with the law, practice, and constitutional usage governing the like withholding of assent or reservation in the Dominion of Canada
ga: Chó luath agus a bheidh aon Bhille rithte no tuigthe do bheith rithte ag an dá Thigh, cuirfidh an Ard-Chomhairle ag triall ar Ionadaí na Coróinneach é chun go cuirfe sé siúd in úil, in ainm an Rí, aontú an Rí leis, agus féadfaidh an an t-Ionadaí sin aontú in Rí do choinneáil siar nó an Bille do mhoilliú chun toil an Rí 'na thaobh do chur in úil: Ar choiníoll le linn do an t-aontú san d'aon Bhille do choinneáil siar no aon Bhille do mhoilliú, go ndéanfaidh Ionadaí na Coróinneach do réir an dlí agus an cleachta agus an úsáid bhun-reachtúil a rialuíonn a leithéid de choinneáil aontú siar no de mhoilliú i dTiarnas Canada

source: A Bill reserved for the signification of the King's Pleasure shall not have any force unless and until within one year from the day on which it was presented to the Representative of the Crown for the King's Assent, the Representative of the Crown signifies by speech or message to each of the Houses of the Oireachtas, or by proclamation, that it has received the Assent of the King in Council
ga: Bille a moilleofar chun Toil an Rí 'na thaobh do chur in úil, ní bheidh aon fheidhm aige mara ndéanfaidh agus go dtí go ndéanfaidh Ionadaí na Coróinneach, fé cheann bliana ón lá do tíolacadh d'Ionadaí na Coróinneach é chun Aontú an Rí d'fháil, a chur in úil, le hóráid no le teachtaireacht do gach Tigh den Oireachtas, no le furógra, go bhfuil Aontú an Rí i gComhairle fachta 'na leith

source: An entry of every such speech, message or proclamation shall be made in the Journal of each House and a duplicate thereof duly attested shall be delivered to the proper officer to be kept among the Records of the Irish Free State (Saorstát Eireann)
ga: Cuirfear cúntas ar gach óráid, teachtaireacht, no furógra dá sórt síos i gCinn-lae gach Tighe agus tabharfar a n-aithghein fé dhearbhú cuibhe don oifigeach ceart le cimeád imeasc Annála Shaorstáit Éireann

source: As soon as may be after any law has received the King's assent, the clerk, or such officer as Dáil Eireann may appoint for the purpose, shall cause two fair copies of such law to be made, one being in the Irish language and the other in the English language (one of which copies shall be signed by the Representative of the Crown to be enrolled for record in the office of such officer of the Supreme Court as Dáil Eireann may determine), and such copies shall be conclusive evidence as to the provisions of every such law and in case of conflict between the two copies so deposited, that signed by the Representative of the Crown shall prevail
ga: Chó luath agus féadfar tar éis d'aon dlí aontú an Rí d'fháil, cuirfidh an cléireach no pé oifigeach eile a cheapfaidh Dáil Éireann chuige sin dhá chóip chearta den dlí sin á dhéanamh, ceann aca i nGaedhilg agus an ceann eile i mBéarla (agus sighneoidh Ionadaí na Coróinneach ceann de sna cóipeanna san chun é do chur ar rolla cuimhnte in oifig an oifigigh sin den Chúirt Uachtarach ar a gcinnfidh Dáil Éireann), agus beidh na cóipeanna san mar fhínéacht chríochnuithe ar fhorálacha gach dlí dá sórt, agus i gcás coinbhlíocht idir an dá chóip a cuirfear i dtaisce mar sin, sé an ceann a bheidh sighnithe ag Ionadaí na Coróinneach a bhuaidhfidh

source: The Oireachtas shall have no power to declare acts to be infringements of the law which were not so at the date of their commission
ga: Ní bheidh de chomhacht ag an Oireachtas a fhógairt gur brise dlí gníomhartha nár bhrise dlí iad le linn a ndéanta

source: The Oireachtas may create subordinate legislatures with such powers as may be decided by law
ga: Féadfaidh an t-Oireachtas cóireanna íochtaracha reachtúcháin do bhunú agus pé comhachta a socrófar le dlí do thabhairt dóibh

source: The Oireachtas may provide for the establishment of Functional or Vocational Councils representing branches of the social and economic life of the Nationa
ga: Féadfaidh an t-Oireachtas soláthar do dhéanamh chun Comhairlí Feidhme no Gairm-bheatha do bhunú a ionadóidh brainsí de bheatha cho-mhuinteartha agus chó-ionmhasach an Náisiúin

source: A law establishing any such Council shall determine its powers, rights and duties, and its relation to the government of the Irish Free State (Saorstát Eireann)
ga: Déanfaidh an dlí le n-a mbunófar Comhairle dá sórt a comhachta, a cearta agus a dualgaisí agus an bhaint a bheidh aice le rialtas Shaorstáit Éireann do shocrú

source: The Oireachtas has the exclusive right to regulate the raising and maintaining of such armed forces as are mentioned in the Scheduled Treaty in the territory of the Irish Free State (Saorstát Eireann) and every such force shall be subject to the control of the Oireachtas
ga: Is ag an Oireachtas amháin atá an t-aon cheart chun rialú do dhéanamh i dtaobh tógaint agus cothú na bhfórsaí armtha san i gcríocha Shaorstáit Éireann atá luaidhte sa Chonnradh Sgeidealta, agus beidh gach fórsa dá shórt fé smacht an Oireachtais
